/* Copyright (c) 2011, Code Aurora Forum. All rights reserved.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 and
 * only version 2 as published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA
 * 02110-1301, USA.
 *
 */

#include <linux/slab.h>
#include <linux/delay.h>
#include <linux/types.h>
#include <linux/i2c.h>
#include <linux/uaccess.h>
#include <linux/miscdevice.h>
#include <media/msm_camera.h>
#include <mach/gpio.h>
#include "mt9d112.h"
#include <linux/pwm.h>
#include <linux/leds_pwm.h>
#include <linux/leds.h>
#include <linux/err.h>
#include <linux/pwm.h>

/* Micron MT9D112 Registers and their values */
/* Sensor Core Registers */
#define  REG_MT9D112_MODEL_ID 0x0000
#define  MT9D112_MODEL_ID     0x2880
#define  MT9D112_AF_STATUS    0xB000
/*  SOC Registers Page 1  */
#define  REG_MT9D112_SENSOR_RESET     0x301A
#define  REG_MT9D112_STANDBY_CONTROL  0x3202
#define  REG_MT9D112_MCU_BOOT         0x3386

#define FLASH_LED

int Flash_Flag = -1;
int effect_mode = -1;
int wb_mode = -1;
int scene_mode = -1;
int brightness_mode = -1;

#if 0
#ifdef FLASH_LED

	struct led_pwm_data {
	struct led_classdev	cdev;
	struct pwm_device	*pwm;
	unsigned int 		active_low;
	unsigned int		period;
};

	struct led_pwm_data *led_dat;
	struct led_pwm *cur_led;

#endif
#endif

struct mt9d112_work {
	struct work_struct work;
};

struct pga_struct {
    int32_t g1_p0q2;     /* 0x3644 */
    int32_t r_p0q2;    /* 0x364E */
    int32_t b_p0q1;    /* 0x3656 */
    int32_t b_p0q2;    /* 0x3658 */
    int32_t g2_p0q2;    /* 0x3662 */
    int32_t r_p1q0;    /* 0x368A */
    int32_t b_p1q0;    /* 0x3694 */
    int32_t g1_p2q0;    /* 0x36C0 */
    int32_t r_p2q0;    /* 0x36CA */
    int32_t b_p2q0;    /* 0x36D4 */
    int32_t g2_p2q0;    /* 0x36DE */
};

static struct  mt9d112_work *mt9d112_sensorw;
static struct  i2c_client *mt9d112_client;

struct mt9d112_ctrl {
	const struct msm_camera_sensor_info *sensordata;
};

static unsigned short use_old_module = 0; /*yangyuan 20110922*/

static struct mt9d112_ctrl *mt9d112_ctrl;

static int32_t mt9d112_i2c_read(unsigned short   saddr,	unsigned short raddr, unsigned short *rdata, enum mt9d112_width width);

static DECLARE_WAIT_QUEUE_HEAD(mt9d112_wait_queue);
DECLARE_MUTEX(mt9d112_sem);
//static int16_t mt9d112_effect = CAMERA_EFFECT_OFF;
//static int16_t mt9d112_scene = CAMERA_BESTSHOT_OFF;

/*=============================================================
	EXTERNAL DECLARATIONS
==============================================================*/
extern struct mt9d112_reg mt9d112_regs;


/*=============================================================*/

static int mt9d112_reset(const struct msm_camera_sensor_info *dev)
{
	int rc = 0;

